/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   check_map.c                                        :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: hyungjup <hyungjup@student.42.fr>          +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2023/09/04 20:54:27 by hyungjup          #+#    #+#             */
/*   Updated: 2023/09/05 15:14:41 by hyungjup         ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "../cub3D.h"

/*
1.맵이 가장 마지막에 위치
2. 다른 구성요소는 순서 상관 없이 위치
3. 다른 구성요소 사이에 개행이 들어가도 됨
4. 화면 크기는 우리가 정하기 나름
5. 동, 서, 남, 북 텍스쳐는 open으로 유효성 검사
6. 바닥, 천장 색상은 R, G, B 형식으로 0 ~ 255
7. 정보는 하나 이상의 공백으로 구분 될 수 있다.*/

int	check_valid_map(char *str)
{
	
	return ();
}
